# AreaCreationData Class

---
A class which wraps the arguments of Area for batch creation
SystemObject Autodesk.Revit.CreationAreaCreationData
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class AreaCreationData

    Public Class AreaCreationData

    public ref class AreaCreationData

    type AreaCreationData = class end
The AreaCreationData type exposes the following members.
| Name| Description
---|---|---
| AreaCreationData(Object)| Initializes a new instance of the AreaCreationData class
| AreaCreationData(ViewPlan, UV)| The data needed to create a new area
Top
| Name| Description
---|---|---
| TagPoint|  Specify the location of the area tag.
Top
| Name| Description
---|---|---
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.Creation Namespace